In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
from pandas import Series

In [24]:
a1 = pd.Series([2.0, 4.5, 6.0, 8.5, 10.0], index=['a', 'b', 'f', 'd','e'])
a2 = pd.Series([1.5, 3.0, 5.5, 7.0, 9.5], index=['b', 'a', 'e', 'd','f'])

In [25]:
a1

a     2.0
b     4.5
f     6.0
d     8.5
e    10.0
dtype: float64

In [26]:
a2

b    1.5
a    3.0
e    5.5
d    7.0
f    9.5
dtype: float64

In [27]:
a1 + a2

a     5.0
b     6.0
d    15.5
e    15.5
f    15.5
dtype: float64

In [39]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('abc'), index=['Olma', 'Uzum', 'Anor'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('acg'), index=['Olma','Anor','Uzum','Orik'])

In [40]:
df1

      a  b  c
Olma  0  1  2
Uzum  3  4  5
Anor  6  7  8

In [41]:
df2

        a     c     g
Olma  0.0   1.0   2.0
Anor  3.0   4.0   5.0
Uzum  6.0   7.0   8.0
Orik  9.0  10.0  11.0

In [42]:
df1 + df2

        a   b     c   g
Anor  9.0 NaN  12.0 NaN
Olma  0.0 NaN   3.0 NaN
Orik  NaN NaN   NaN NaN
Uzum  9.0 NaN  12.0 NaN

In [43]:
df1.add(df2)

        a   b     c   g
Anor  9.0 NaN  12.0 NaN
Olma  0.0 NaN   3.0 NaN
Orik  NaN NaN   NaN NaN
Uzum  9.0 NaN  12.0 NaN

In [45]:
df1

      a  b  c
Olma  0  1  2
Uzum  3  4  5
Anor  6  7  8

In [46]:
df1.add(df2, fill_value=0)

        a    b     c     g
Anor  9.0  7.0  12.0   5.0
Olma  0.0  1.0   3.0   2.0
Orik  9.0  NaN  10.0  11.0
Uzum  9.0  4.0  12.0   8.0

In [47]:
df1.sub(df2, fill_value=0)

        a    b     c     g
Anor  3.0  7.0   4.0  -5.0
Olma  0.0  1.0   1.0  -2.0
Orik -9.0  NaN -10.0 -11.0
Uzum -3.0  4.0  -2.0  -8.0

In [48]:
df2.rsub(df1)

        a   b    c   g
Anor  3.0 NaN  4.0 NaN
Olma  0.0 NaN  1.0 NaN
Orik  NaN NaN  NaN NaN
Uzum -3.0 NaN -2.0 NaN

In [49]:
df2.rsub(df1, fill_value=0)

        a    b     c     g
Anor  3.0  7.0   4.0  -5.0
Olma  0.0  1.0   1.0  -2.0
Orik -9.0  NaN -10.0 -11.0
Uzum -3.0  4.0  -2.0  -8.0

In [50]:
df2.div(df1)

        a   b    c   g
Anor  0.5 NaN  0.5 NaN
Olma  NaN NaN  0.5 NaN
Orik  NaN NaN  NaN NaN
Uzum  2.0 NaN  1.4 NaN

In [51]:
df2.div(df1, fill_value=0)

        a    b    c    g
Anor  0.5  0.0  0.5  inf
Olma  NaN  0.0  0.5  inf
Orik  inf  NaN  inf  inf
Uzum  2.0  0.0  1.4  inf

In [53]:
df1.div(df2, fill_value=0)

        a    b         c    g
Anor  2.0  inf  2.000000  0.0
Olma  NaN  inf  2.000000  0.0
Orik  0.0  NaN  0.000000  0.0
Uzum  0.5  inf  0.714286  0.0

In [54]:
df2.rdiv(df1, fill_value=0)

        a    b         c    g
Anor  2.0  inf  2.000000  0.0
Olma  NaN  inf  2.000000  0.0
Orik  0.0  NaN  0.000000  0.0
Uzum  0.5  inf  0.714286  0.0

In [63]:
df = pd.DataFrame(np.arange(1,13.).reshape(3,4),index=list('abc'), columns=['Olma','Uzum','Anjir','Banan'])
obj = pd.Series([9,8,7,6], index=df.columns)

In [64]:
df

   Olma  Uzum  Anjir  Banan
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [65]:
obj

Olma     9
Uzum     8
Anjir    7
Banan    6
dtype: int64

In [66]:
df.add(obj)

   Olma  Uzum  Anjir  Banan
a  10.0  10.0   10.0   10.0
b  14.0  14.0   14.0   14.0
c  18.0  18.0   18.0   18.0

In [67]:
obj['Olma']

9

In [68]:
df + obj['Olma']

   Olma  Uzum  Anjir  Banan
a  10.0  11.0   12.0   13.0
b  14.0  15.0   16.0   17.0
c  18.0  19.0   20.0   21.0

In [71]:
df3 = pd.DataFrame(np.random.rand(3,4), index=list('ABC'), columns=['Olma','Anor','Banan','Ananas'])

In [72]:
df3

       Olma      Anor     Banan    Ananas
A  0.217519  0.659839  0.514389  0.206483
B  0.999631  0.299657  0.456723  0.507851
C  0.462139  0.956708  0.392423  0.870765

In [76]:
df3.mean()

Olma      0.559763
Anor      0.638735
Banan     0.454512
Ananas    0.528366
dtype: float64

In [74]:
np.abs(df3)

       Olma      Anor     Banan    Ananas
A  0.217519  0.659839  0.514389  0.206483
B  0.999631  0.299657  0.456723  0.507851
C  0.462139  0.956708  0.392423  0.870765

In [77]:
np.round(df3)

   Olma  Anor  Banan  Ananas
A   0.0   1.0    1.0     0.0
B   1.0   0.0    0.0     1.0
C   0.0   1.0    0.0     1.0